Repository: objective-php/docs
Catalog: locale/*/LC_MESSAGES/01-getting-started.po
Languages: fr

source: Getting started with Objective PHP
fr: Démarrer avec Objective PHP

source: Pre-requisites
fr: Pré-requis

source: The most important pre-requisite needed to use Objective PHP is PHP7.
fr: Le pré-requis principal nécessaire pour utiliser Objective PHP est PHP7

source: If you don't have it installed yet, please take a look at `Official PHP website <http://www.php.net>`_ and read instruction about PHP7 installation on your development machine.
fr: Si vous ne l'avez pas encore installé, consultez le `site officiel de PHP <http://www.php.net>`_ où vous trouverez les instructions nécessaires à l'installation de PHP7 sur votre machine de dévelopmment.

source: The easiest way to start a project with Objective PHP is to use composer's "create-project" feature and get the Objective PHP Starter Kit:
fr: La façon la plus simple de démarrer un projet avec Objective PHP est d'utiliser la fonctionnalité "create-project" de composer et d'obtenir le starter kit d'Objective PHP :

source: Where *op-quick-start* should be replaced with anything matching your actual project name.
fr: *op-quick-start* devrait être remplacé par n'importe quel identifiant correspondant à votre projet réel.

source: Starting a server
fr: Démarrer un serveur

source: To quickly run and access the starter application, you can use the internal PHP HTTP server:
fr: Pour lancer rapidement l'application starter, vous pouvez utiliser le serveur web embarqué de PHP:

source: Keep adding methods like this for everything you want to document. It is recommended to only document public methods like this. Private and protected methods should stay isolated and only documented in the source code.
fr: Si vous ne l'avez pas encore installé, rendez vous sur le `site officiel de PHP<http://www.php.net>`_ et consultez les instructions relatives à l'installation de PHP7 sur votre machine de développement

source: That's it! If everything went fine, you should be able to point a browser to http://localhost:8080 and access the starter kit home page.
fr: Et voilà ! Si tout s'est bien passé, vous devriez pouvoir consulter la page d'accueil du starter kit en vous rendant sur http://localhost:8080.
